backups/consruc_req_20260130_102853.xml

<?xml version="1.0" encoding="UTF-8"?><soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:ns0="http://ekuatia.set.gov.py/sifen/xsd">  <soap12:Header/>  <soap12:Body>    <ns0:rEnviConsRUC>      <ns0:dId>001769779733329</ns0:dId>      <ns0:dRUCCons>4554737</ns0:dRUCCons>    </ns0:rEnviConsRUC>  </soap12:Body></soap12:Envelope>